spec/support/fixtures/evt_charge_failed.json

{
  "id": "evt_charge_failed",
  "created": 1399928124,
  "livemode": false,
  "type": "charge.failed",
  "data": {
    "object": {
      "id": "ch_1041TP2MJ4vAOzhl6W1bQBYg",
      "object": "charge",
      "created": 1399928124,
      "livemode": false,
      "paid": false,
      "amount": 996,
      "currency": "usd",
      "refunded": false,
      "card": {
        "id": "card_1041TO2MJ4vAOzhlvteZQVVB",
        "object": "card",
        "last4": "0341",
        "type": "Visa",
        "exp_month": 5,
        "exp_year": 2021,
        "fingerprint": "bTTgX011kl1QXASC",
        "customer": "cus_3zLBfzAWn0rnYL",
        "country": "US",
        "name": null,
        "address_line1": null,
        "address_line2": null,
        "address_city": null,
        "address_state": null,
        "address_zip": null,
        "address_country": null,
        "cvc_check": "pass",
        "address_line1_check": null,
        "address_zip_check": null
      },
      "captured": false,
      "refunds": [],
      "balance_transaction": null,
      "failure_message": "Your card was declined.",
      "failure_code": "card_declined",
      "amount_refunded": 0,
      "customer": "cus_3zLBfzAWn0rnYL",
      "invoice": null,
      "description": "test failed charge",
      "dispute": null,
      "metadata": {},
      "statement_description": null
    }
  },
  "object": "event",
  "pending_webhooks": 1,
  "request": "iar_41TP15NzRGU0VY"
}
